## Exercise

Name: Samuel Natamihardja

In [185]:
import pandas as pd

#from website
imdb = pd.read_csv("https://raw.githubusercontent.com/scalabretta/GroupProject--IMDB/master/Dataset/IMDB-database-update.csv",encoding='latin1')

1) How many rows and columns reflected on dataset file IMDB-database-update.csv?

In [186]:
print("There's " + str(imdb.shape[0])+ " rows and "  + str(imdb.shape[1]) + " columns.")

There's 3781 rows and 36 columns.

2) What are the top 3 movies with highest nett profit in 2015?

In [66]:
imdb[['movie_title','net_USD']].sort_values(by=["net_USD"], ascending= False).head(3)

       movie_title    net_USD
0           Avatar  523505847
14  Jurassic World  502177271
11         Titanic  458672302

3) What are the top 3 movies with highest gross profit in 2016?

In [69]:
imdb[['movie_title','gross_USD']].sort_values(by=["gross_USD"], ascending= False).head(3)

       movie_title  gross_USD
0           Avatar  760505847
11         Titanic  658672302
14  Jurassic World  652177271

4) How many non-english movies are in the dataset

In [89]:
len(imdb[imdb.language != "English"])

153

5) What are top 3 languages in the data set aside English (based on number of movies)?

In [94]:
imdb["language"][imdb.language != "English"].value_counts().head(3)

French      33
Spanish     23
Mandarin    14
Name: language, dtype: int64

6) What are the top 3 countries with the highest nett profit in all dataset times?

In [123]:
# imdb[['country','net_USD']].sort_values(by=["net_USD"], ascending= False).head(3)

net_per_country = pd.DataFrame(imdb.groupby('country')['net_USD'].max())

net_per_country.sort_values(by=['net_USD'], ascending=False).head(3)

               net_USD
country
USA          523505847
Japan        248505540
New Zealand  220837577

7) What are the average budget of all movies in dataset in 2015?

In [160]:
budgets_2015 = imdb[imdb.title_year ==2015]["budget_USD"]

average_budget_2015 = sum(budgets_2015)/len(budgets_2015)
print("The average budget of all movies in 2015: "+ str(round(average_budget_2015,1)))

The average budget of all movies in 2015: 55471931.8

8) What are the average budget of all movies in dataset in 2016?

In [162]:
budgets_2016 = imdb[imdb.title_year ==2016]["budget_USD"]

average_budget_2016 = sum(budgets_2016)/len(budgets_2016)
print("The average budget of all movies in 2016: "+ str(round(average_budget_2016,1)))

The average budget of all movies in 2016: 69225757.6

9) Which one is higher, average budget of all movies in dataset in 2015 or 2016?

In [171]:
temp_compare = "";

if(average_budget_2015>average_budget_2016):
    temp_compare ="2015"
else: 
    temp_compare ="2016"

print("the average budget that higher is "+ temp_compare)

the average budget that higher is 2016

10) What movie that resulted highest nett profit of all dataset times? How much did the movie make?

In [182]:
imdb[['movie_title','net_USD']].sort_values(by=["net_USD"], ascending= False).head(1)

  movie_title    net_USD
0      Avatar  523505847